In [1]:
#https://www.youtube.com/watch?v=0qcYgDBJ56I
import pandas as pd

In [2]:
data = pd.read_csv('data.csv')

In [3]:
data['Date'] = pd.to_datetime(data['Date'])
data.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
dtype: object

In [4]:
data['Date'].dt.dayofyear.head()

0    138
1    139
2    140
3    141
4    142
Name: Date, dtype: int64

In [5]:
data['Date'].dt.strftime("%a").head()

# %A -Full weekday name like MONDAY, TUESDAY etc
# %w -Weekday as a decimal number like 1,2,3 etc
# %a -Abbreviated weekday name like SUN,MON etc
# %Y -year
# %m -month
# %d -day
# %H -hours
# %M -minutes
# %S -seconds

0    Sat
1    Sun
2    Mon
3    Tue
4    Wed
Name: Date, dtype: object

In [6]:
data['Date'].dt.weekofyear.head()
# between 1 - 52

/var/folders/mx/b2s2fns51plfn__sspbylxk00000gn/T/ipykernel_776/1367111906.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  data['Date'].dt.weekofyear.head()

0    20
1    20
2    21
3    21
4    21
Name: Date, dtype: int64

In [7]:
data['Date'].dt.dayofweek.head()

0    5
1    6
2    0
3    1
4    2
Name: Date, dtype: int64

In [8]:
# extract year month day etc to crete a ne column in you data set
data.year = data['Date'].dt.year
data.year.value_counts()

/var/folders/mx/b2s2fns51plfn__sspbylxk00000gn/T/ipykernel_776/2806098223.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  data.year = data['Date'].dt.year

2019    14
Name: Date, dtype: int64

In [9]:
data['Year'] = data['Date'].dt.year
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Year
0,2019-05-18,7266.080078,8281.660156,7257.259766,8193.139648,8193.139648,723011166,2019
1,2019-05-19,8193.139648,8193.139648,7591.850098,7998.290039,7998.290039,637617163,2019
2,2019-05-20,7998.290039,8102.319824,7807.770020,7947.930176,7947.930176,357803946,2019
3,2019-05-21,7947.930176,8033.759766,7533.660156,7626.890137,7626.890137,424501866,2019
4,2019-05-22,7626.890137,7971.259766,7478.740234,7876.500000,7876.500000,386766321,2019

In [10]:
data.month = data['Date'].dt.month
data.month.value_counts()

/var/folders/mx/b2s2fns51plfn__sspbylxk00000gn/T/ipykernel_776/619523928.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  data.month = data['Date'].dt.month

5    14
Name: Date, dtype: int64